# pandas library

In [1]:
import pandas as pd

# series create,manipulate,query,delete

In [2]:
#creating a series from a list
arr=[0,1,2,3,4]
s1=pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [3]:
order=[1,2,3,4,5]
s2=pd.Series(arr,index=order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [4]:
import numpy as np
n=np.random.randn(5) #create a random Ndarray
n

array([-0.32891889,  1.12961956,  0.35702032,  1.43111966, -0.2179001 ])

In [5]:
import numpy as np
n=np.random.randn(5) #create a random Ndarray
index = ['a','b','c','d','e']
s2 = pd.Series(n, index=index)
s2

a    1.063697
b   -0.061675
c    2.322907
d    1.490063
e    1.298153
dtype: float64

In [6]:
#create series from dictionary
d={'a':1,'b':2,'c':3,'d':4,'e':5}
s3=pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
#modifying the index of series
print(s1)
s1.index=['A','B','C','D','E']
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [8]:
order=[1,2,3,4,5]
s2=pd.Series(arr,index=order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [9]:
#slicing
a=s1[:3]
a

A    0
B    1
C    2
dtype: int64

In [10]:
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [14]:
s4=s1.add(s3)
s4

A   NaN
B   NaN
C   NaN
D   NaN
E   NaN
a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

In [15]:
s4.drop('e')

A   NaN
B   NaN
C   NaN
D   NaN
E   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [16]:
s4

A   NaN
B   NaN
C   NaN
D   NaN
E   NaN
a   NaN
b   NaN
c   NaN
d   NaN
e   NaN
dtype: float64

# Series Operations

In [17]:
arr1=[0,1,2,3,4,5,7]
arr2=[6,7,8,9,5]

In [18]:
s5=pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [19]:
s6=pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [20]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [21]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [22]:
s5.mul(s6)

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [23]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [24]:
print('median',s6.median())
print('max',s6.max())
print('min',s6.min())

median 3.0
max 7
min 0

# Create Dataframe

In [25]:
dates=pd.date_range('today',periods=6) #define time sequence as index
dates

DatetimeIndex(['2023-07-30 20:11:55.375175', '2023-07-31 20:11:55.375175',
               '2023-08-01 20:11:55.375175', '2023-08-02 20:11:55.375175',
               '2023-08-03 20:11:55.375175', '2023-08-04 20:11:55.375175'],
              dtype='datetime64[ns]', freq='D')

In [26]:
dates=pd.date_range('today',periods=6) #define time sequence as index
num_arr=np.random.randn(6,4) #Import numpy random array
num_arr

array([[ 0.92953246,  0.61496861,  1.58724611, -0.4848414 ],
       [-1.27453647, -0.32011907, -0.71569104, -1.93087414],
       [ 1.48840456,  0.02793674, -1.48422221, -0.5256025 ],
       [ 0.16393568,  1.25003125,  0.03509119,  1.34057937],
       [ 0.14513307,  0.24072686,  0.85750813, -0.67022282],
       [ 0.34530888, -0.0127594 , -0.77159222, -0.95782241]])

In [27]:
dates=pd.date_range('today',periods=6) #define time sequence as index
num_arr=np.random.randn(6,4) #Import numpy random array
columns=['A','B','C','D'] #Use the table as the column name
columns

df1=pd.DataFrame(num_arr,index=dates,columns=columns)
df1

                                   A         B         C         D
2023-07-30 20:11:57.650080  0.018513  1.656236 -1.125539  1.580606
2023-07-31 20:11:57.650080 -1.688321  1.546394  1.120221 -0.502407
2023-08-01 20:11:57.650080  1.244448 -0.547851  1.038145  1.907219
2023-08-02 20:11:57.650080  0.022589  0.119357 -0.088160  0.963974
2023-08-03 20:11:57.650080 -0.254674  0.784950 -1.484253  0.611543
2023-08-04 20:11:57.650080  0.449366 -0.186043  0.359305 -1.195101

In [28]:
#create dataframe with dictionary array

data={'animal': ['cat','cat','snake','dog','dog','cat','snake','cat','dog','dog'],
     'age': [2.5,3,0.5,np.nan,5,2,4.5,np.nan,7,3],
     'visits': [1,3,2,3,2,3,1,1,2,1],
     'priority': ['yes','yes','no','yes','no','no','no','yes','no','no']}
labels= ['a','b','c','d','e','f','g','h','i','j']

df2=pd.DataFrame(data, index=labels)
df2

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [29]:
#see datatypes of array
df2.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [30]:
df2.head(6)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no

In [31]:
df2.tail(3)

  animal  age  visits priority
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [32]:
print(df2.index)
df2.columns

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

In [33]:
df2.values

array([['cat', 2.5, 1, 'yes'],
       ['cat', 3.0, 3, 'yes'],
       ['snake', 0.5, 2, 'no'],
       ['dog', nan, 3, 'yes'],
       ['dog', 5.0, 2, 'no'],
       ['cat', 2.0, 3, 'no'],
       ['snake', 4.5, 1, 'no'],
       ['cat', nan, 1, 'yes'],
       ['dog', 7.0, 2, 'no'],
       ['dog', 3.0, 1, 'no']], dtype=object)

In [34]:
df2.describe() #see statitical data of dataframe

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [35]:
df2.T

            a    b      c    d    e    f      g    h    i    j
animal    cat  cat  snake  dog  dog  cat  snake  cat  dog  dog
age       2.5  3.0    0.5  NaN  5.0  2.0    4.5  NaN  7.0  3.0
visits      1    3      2    3    2    3      1    1    2    1
priority  yes  yes     no  yes   no   no     no  yes   no   no

In [36]:
df2.sort_values(by='age')

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [37]:
#slicing dataframe
df2.sort_values(by='age')[1:3]

  animal  age  visits priority
f    cat  2.0       3       no
a    cat  2.5       1      yes

In [38]:
#query dataframe by tag
df2[['age','visits']]

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2
f  2.0       3
g  4.5       1
h  NaN       1
i  7.0       2
j  3.0       1

In [39]:
df2.iloc[1:3] #query rows 2,3

  animal  age  visits priority
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [40]:
df3=df2.copy()
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [41]:
df3.isnull()

   animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [42]:
df3.loc['f','age']=1.5
df3

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [45]:
df3.sum()

animal      catcatsnakedogdogcatsnakecatdogdog
age                                       27.0
visits                                      19
priority              yesyesnoyesnononoyesnono
dtype: object

In [46]:
string=pd.Series(['A','C','D','Aa','BaCa',np.nan,'CBA','cow','owl'])
string.str.lower()

0       a
1       c
2       d
3      aa
4    baca
5     NaN
6     cba
7     cow
8     owl
dtype: object

# operations for dataframe missing values

In [47]:
df4=df3.copy()
meanAge=df4['age'].mean()
df4['age'].fillna(4)

a    2.5
b    3.0
c    0.5
d    4.0
e    5.0
f    1.5
g    4.5
h    4.0
i    7.0
j    3.0
Name: age, dtype: float64

In [48]:
df5=df3.copy()
df5.dropna(how='any')
df5

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [52]:
df_animal=pd.read_csv('zoo.csv')
df_animal.head(3)

,animal_name,hair,feathers,eggs,milk,airborne,aquatic,predator,toothed,backbone,breathes,venomous,fins,legs,tail,domestic,catsize,class_type
0,aardvark,1,0,0,1,0,0,1,1,1,1,0,0,4,0,0,1,1
1,antelope,1,0,0,1,0,0,0,1,1,1,0,0,4,1,0,1,1
2,bass,0,0,1,0,0,1,1,1,1,0,0,1,0,1,0,0,4

In [54]:
df3.to_excel('animal.xlsx',sheet_name='sheet1')
df_aniaml2= pd.read_excel('animal.xlsx','sheet1',index_col=None, na_values=['NA'])
#df_animal2